//==================================================================================================================================
//이 서버는 초기에 사용된 단일 서버로 
// 실제 게임에서는 플레이어들의 매칭 전 로비를 관리하는 LobbyServer와 
// 매칭 후 실제 전투를 관리하는  BattleServer로 
// 현재 서버의 기능들을 나눠 분할 서버로 돌아갈 예정입니다.
//==================================================================================================================================

#include "pch.h"
#include "CorePch.h"
#include "CLIENT.h"
#include "Overlap.h"
#include "ConcurrentQueue.h"
#include "ConcurrentStack.h"
#include "GameDataBase.h"
#include "LobbyServer.h"
#include "BattleServer.h"

int main()
{
	
	wcout.imbue(locale("korean"));
	LobbyServer server;
	Init_DB();
	server.Init(MAX_TH);
	server.BindListen(SERVER_PORT);
	server.Run();
	server.End();
	DB_Rel();
	
}

//----------------------------------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------------------------------

